app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Jake and Joe's"], ["created_at", "2017-10-10 00:08:02.742357"], ["updated_at", "2017-10-10 00:08:02.742357"]]
---
  def create
    @restaurant = Restaurant.new(restaurant_params)

    respond_to do |format|
      if @restaurant.save

UPDATE "restaurants" SET "address" = $1, "updated_at" = $2 WHERE "restaurants"."id" = $3  [["address", "110 Main Street, Braintree, MA 02188"], ["updated_at", "2017-10-10 00:56:36.439199"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @restaurant.update(restaurant_params)